In [21]:
from common import *

cursor = connect()

# Aggregate Functions

有以下：
- AVG
- COUNT
- MAX
- MIN
- SUM

语法
```
SELECT column1, AGGREGATE_FUNCTION(column2)
FROM table1
GROUP BY column1;
```

## AVG

In [2]:
sql = """
SELECT 
  ROUND(AVG(replacement_cost), 2) avg_replacement_cost 
FROM 
  film;
"""
run_sql(cursor, sql)

  avg_replacement_cost
0                19.98

In [3]:
sql = """
SELECT 
  ROUND(
    AVG(replacement_cost), 
    2
  ) avg_replacement_cost 
FROM 
  film 
  INNER JOIN film_category USING(film_id) 
  INNER JOIN category USING(category_id) 
WHERE 
  category_id = 7;
"""
run_sql(cursor, sql)

  avg_replacement_cost
0                21.09

In [2]:
sql = """
SELECT AVG(amount)::numeric(10,2) 
FROM payment;
"""
run_sql(cursor, sql)

    avg
0  4.20

In [3]:
# With DISTINCT

sql = """
SELECT AVG(DISTINCT amount)::numeric(10,2)
FROM payment;
"""
run_sql(cursor, sql)

    avg
0  6.14

In [4]:
# With GROUP BY
sql = """
SELECT 
  customer_id, 
  first_name, 
  last_name, 
  AVG (amount):: numeric(10, 2) 
FROM 
  payment 
  INNER JOIN customer USING(customer_id) 
GROUP BY 
  customer_id 
ORDER BY 
  customer_id;
"""
run_sql(cursor, sql)

     customer_id first_name  last_name   avg
0              1       Mary      Smith  3.82
1              2   Patricia    Johnson  4.76
2              3      Linda   Williams  5.45
3              4    Barbara      Jones  3.72
4              5  Elizabeth      Brown  3.85
..           ...        ...        ...   ...
594          595   Terrence  Gunderson  3.82
595          596    Enrique   Forsythe  3.35
596          597    Freddie     Duggan  3.82
597          598       Wade   Delvalle  3.81
598          599     Austin    Cintron  4.38

[599 rows x 4 columns]

In [19]:
sql = """
SELECT 
  customer_id, 
  first_name, 
  last_name, 
  AVG (amount):: NUMERIC(10, 2) 
FROM 
  payment 
  INNER JOIN customer USING(customer_id) 
GROUP BY 
  customer_id 
HAVING 
  AVG (amount) > 5 
ORDER BY 
  customer_id;
"""
run_sql(cursor, sql)

    customer_id first_name last_name   avg
0             3      Linda  Williams  5.45
1            19       Ruth  Martinez  5.49
2           137     Rhonda   Kennedy  5.04
3           181        Ana   Bradley  5.08
4           187   Brittany     Riley  5.62
5           209      Tonya   Chapman  5.09
6           259       Lena    Jensen  5.16
7           272        Kay  Caldwell  5.07
8           285     Miriam  Mckinney  5.12
9           293        Mae  Fletcher  5.13
10          310     Daniel    Cabral  5.30
11          311       Paul     Trout  5.39
12          321      Kevin   Schuler  5.52
13          470     Gordon    Allard  5.09
14          472       Greg    Robins  5.07
15          477        Dan     Paine  5.09
16          508     Milton   Howland  5.29
17          522     Arnold    Havens  5.05
18          542     Lonnie    Tirado  5.30
19          583   Marshall     Thorn  5.12

## COUNT

In [4]:
sql = """
SELECT 
  COUNT(*) 
FROM 
  film;
"""
run_sql(cursor, sql)

   count
0   1000

In [5]:
sql = """
SELECT 
  COUNT(*) drama_films 
FROM 
  film 
  INNER JOIN film_category USING(film_id) 
  INNER JOIN category USING(category_id) 
WHERE 
  category_id = 7;
"""
run_sql(cursor, sql)

   drama_films
0           62

In [22]:
sql = """
SELECT 
  COUNT (DISTINCT amount) 
FROM 
  payment;
"""
run_sql(cursor, sql)

   count
0     19

In [23]:
sql = """
SELECT 
  customer_id, 
  COUNT (customer_id) 
FROM 
  payment 
GROUP BY 
  customer_id;
"""
run_sql(cursor, sql)

     customer_id  count
0            184     20
1             87     28
2            477     21
3            273     28
4            550     31
..           ...    ...
594          449     17
595           64     30
596          520     31
597           55     19
598          148     45

[599 rows x 2 columns]

In [24]:
sql = """
SELECT 
  first_name || ' ' || last_name full_name, 
  COUNT (customer_id) 
FROM 
  payment 
INNER JOIN customer USING (customer_id)
GROUP BY 
  customer_id;
"""
run_sql(cursor, sql)

                 full_name  count
0              Vivian Ruiz     20
1          Wanda Patterson     28
2                Dan Paine     21
3           Priscilla Lowe     28
4             Guy Brownlee     31
..                     ...    ...
594           Oscar Aquino     17
595             Judith Cox     30
596  Mitchell Westmoreland     31
597             Doris Reed     19
598           Eleanor Hunt     45

[599 rows x 2 columns]

In [25]:
sql = """
SELECT 
  first_name || ' ' || last_name full_name, 
  COUNT (customer_id) 
FROM 
  payment 
INNER JOIN customer USING (customer_id)
GROUP BY 
  customer_id
HAVING 
  COUNT (customer_id) > 40
"""
run_sql(cursor, sql)

      full_name  count
0     Karl Seal     42
1  Eleanor Hunt     45

## MAX

In [6]:
sql = """
SELECT 
  MAX(replacement_cost) 
FROM 
  film;
"""
run_sql(cursor, sql)

     max
0  29.99

In [7]:
sql = """
SELECT 
  film_id, 
  title 
FROM 
  film 
WHERE 
  replacement_cost =(
    SELECT 
      MAX(replacement_cost) 
    FROM 
      film
  ) 
ORDER BY 
  title;
"""
run_sql(cursor, sql)

    film_id                    title
0        34             Arabia Dogma
1        52     Ballroom Mockingbird
2        81            Blindness Gun
3        85         Bonnie Holocaust
4       138      Chariots Conspiracy
5       157       Clockwork Paradise
6       163             Clyde Theory
7       196       Cruelty Unforgiven
8       199         Cupboard Sinners
9       224  Desperate Trainspotting
10      232                Dirty Ace
11      238             Doctor Grail
12      270             Earth Vision
13      290           Everyone Craft
14      297  Extraordinary Conquerer
15      302            Fantasia Park
16      309             Feud Frogmen
17      322        Flatliners Killer
18      325            Floats Garden
19      358           Gilmore Boiled
20      366   Goldfinger Sensibility
21      374            Graffiti Love
22      417          Hills Neighbors
23      423      Hollywood Anonymous
24      429               Honey Ties
25      450          Idols Snatchers
26      475             Japanese Run
27      480          Jeepers Wedding
28      483            Jericho Mulan
29      487         Jingle Sagebrush
30      510           Lawless Vision
31      525         Loathing Legally
32      537             Lover Truman
33      644               Oscar Gold
34      663           Patient Sister
35      691         Poseidon Forever
36      698           Princess Giant
37      707          Quest Mussolini
38      714                Random Go
39      723          Reign Gentlemen
40      726     Reservoir Adaptation
41      731             Right Cranes
42      733             River Outlaw
43      759            Salute Apollo
44      762             Sassy Packer
45      803         Slacker Liaisons
46      811            Smile Earring
47      819              Song Hedwig
48      901              Tracy Cider
49      921           Uncut Suicides
50      944             Virgin Daisy
51      969                West Lion
52      994            Wyoming Storm

In [26]:
sql = """
SELECT 
  payment_id, 
  customer_id, 
  amount 
FROM 
  payment 
WHERE 
  amount = (
    SELECT 
      MAX (amount) 
    FROM 
      payment
  );
"""
run_sql(cursor, sql)

   payment_id  customer_id amount
0       20403          362  11.99
1       22650          204  11.99
2       23757          116  11.99
3       24553          195  11.99
4       24866          237  11.99
5       28799          591  11.99
6       28814          592  11.99
7       29136           13  11.99

In [27]:
sql = """
SELECT 
  customer_id, 
  MAX (amount) 
FROM 
  payment 
GROUP BY 
  customer_id;
"""
run_sql(cursor, sql)

     customer_id    max
0            184   9.99
1             87  10.99
2            477  10.99
3            273   8.99
4            550  10.99
..           ...    ...
594          449   8.99
595           64   6.99
596          520  10.99
597           55   7.99
598          148  10.99

[599 rows x 2 columns]

In [28]:
sql = """
SELECT 
  customer_id, 
  MAX (amount) 
FROM 
  payment 
GROUP BY 
  customer_id 
HAVING 
  MAX(amount) > 8.99;
"""
run_sql(cursor, sql)

     customer_id    max
0            184   9.99
1             87  10.99
2            477  10.99
3            550  10.99
4             51   9.99
..           ...    ...
260          392   9.99
261           49  10.99
262          434  10.99
263          520  10.99
264          148  10.99

[265 rows x 2 columns]

## MIN

In [8]:
sql = """
SELECT 
  MIN(replacement_cost) 
FROM 
  film;
"""
run_sql(cursor, sql)

    min
0  9.99

In [9]:
sql = """
SELECT 
  film_id, 
  title 
FROM 
  film 
WHERE 
  replacement_cost =(
    SELECT 
      MIN(replacement_cost) 
    FROM 
      film
  ) 
ORDER BY 
  title;

"""
run_sql(cursor, sql)

    film_id                   title
0        23    Anaconda Confessions
1       150            Cider Desire
2       182          Control Anthem
3       203         Daisy Menagerie
4       221  Deliverance Mulholland
5       260          Dude Blindness
6       272            Edge Kissing
7       281              Encino Elf
8       299          Factory Dragon
9       307       Fellowship Autumn
10      348             Gandhi Kwai
11      389    Gunfighter Mussolini
12      409    Heartbreakers Bright
13      476              Jason Trap
14      501           Kissing Dolls
15      522            Life Twisted
16      551             Maiden Home
17      565          Matrix Snowman
18      572         Metropolis Coma
19      623        Newton Labyrinth
20      627           North Tequila
21      629       Notorious Reunion
22      639       Opposite Necklace
23      656           Papi Necklace
24      662           Paths Control
25      686          Pluto Oleander
26      705            Purple Movie
27      747           Roxanne Rebel
28      841          Star Operation
29      845           Stepmom Dream
30      846          Sting Personal
31      863         Sun Confessions
32      875       Talented Homicide
33      880  Telemark Heartbreakers
34      886          Theory Mermaid
35      888          Thin Sagebrush
36      912         Trojan Tomorrow
37      915            Truman Crazy
38      931     Valentine Vanishing
39      953              Wait Cider
40      996          Young Language

## SUM

In [10]:
sql = """
SELECT 
  rating, 
  SUM(rental_duration) 
FROM 
  film
GROUP BY 
  rating 
ORDER BY 
  rating;
"""
run_sql(cursor, sql)

  rating   sum
0      G   861
1     PG   986
2  PG-13  1127
3      R   931
4  NC-17  1080

In [29]:
sql = """
SELECT 
  COALESCE(SUM(amount), 0 ) total
FROM 
  payment 
WHERE 
  customer_id = 2000;
"""
run_sql(cursor, sql)

  total
0     0

In [30]:
sql = """
SELECT 
  customer_id, 
  SUM (amount) AS total 
FROM 
  payment 
GROUP BY 
  customer_id 
ORDER BY 
  total DESC 
LIMIT 
  5;
"""
run_sql(cursor, sql)

   customer_id   total
0          148  211.55
1          526  208.58
2          178  194.61
3          137  191.62
4          144  189.60

## ARRAY_AGG

In [31]:
sql = """
SELECT
    title,
    ARRAY_AGG (first_name || ' ' || last_name) actors
FROM
    film
INNER JOIN film_actor USING (film_id)
INNER JOIN actor USING (actor_id)
GROUP BY
    title
ORDER BY
    title;
"""
run_sql(cursor, sql)

                 title                                             actors
0     Academy Dinosaur  [Penelope Guiness, Christian Gable, Lucille Tr...
1       Ace Goldfinger  [Bob Fawcett, Minnie Zellweger, Sean Guiness, ...
2     Adaptation Holes  [Nick Wahlberg, Bob Fawcett, Cameron Streep, R...
3     Affair Prejudice  [Jodie Degeneres, Scarlett Damon, Kenneth Pesc...
4          African Egg  [Gary Phoenix, Dustin Tautou, Matthew Leigh, M...
..                 ...                                                ...
992     Young Language  [Ed Chase, Julia Mcqueen, James Pitt, Christop...
993         Youth Kick  [Sandra Kilmer, Val Bolger, Scarlett Bening, I...
994       Zhivago Core  [Uma Wood, Nick Stallone, Gary Penn, Salma Nol...
995  Zoolander Fiction  [Carmen Hunt, Mary Tandy, Penelope Cronyn, Who...
996          Zorro Ark           [Ian Tandy, Nick Degeneres, Lisa Monroe]

[997 rows x 2 columns]

In [32]:
sql = """
SELECT
    title,
    ARRAY_AGG (
        first_name || ' ' || last_name
        ORDER BY
            first_name
    ) actors
FROM
    film
INNER JOIN film_actor USING (film_id)
INNER JOIN actor USING (actor_id)
GROUP BY
    title
ORDER BY
    title;
"""
run_sql(cursor, sql)

                 title                                             actors
0     Academy Dinosaur  [Christian Gable, Johnny Cage, Lucille Tracy, ...
1       Ace Goldfinger  [Bob Fawcett, Chris Depp, Minnie Zellweger, Se...
2     Adaptation Holes  [Bob Fawcett, Cameron Streep, Julianne Dench, ...
3     Affair Prejudice  [Fay Winslet, Jodie Degeneres, Kenneth Pesci, ...
4          African Egg  [Dustin Tautou, Gary Phoenix, Matthew Leigh, M...
..                 ...                                                ...
992     Young Language  [Christopher West, Ed Chase, James Pitt, Julia...
993         Youth Kick  [Ian Tandy, Mary Keitel, Sandra Kilmer, Scarle...
994       Zhivago Core  [Gary Penn, Kenneth Hoffman, Nick Stallone, Sa...
995  Zoolander Fiction  [Carmen Hunt, Jada Ryder, Mary Tandy, Penelope...
996          Zorro Ark           [Ian Tandy, Lisa Monroe, Nick Degeneres]

[997 rows x 2 columns]

## STRING_AGG

In [33]:
sql = """
SELECT
    f.title,
    STRING_AGG (
	a.first_name || ' ' || a.last_name,
        ','
       ORDER BY
        a.first_name,
        a.last_name
    ) actors
FROM
    film f
INNER JOIN film_actor fa USING (film_id)
INNER JOIN actor a USING (actor_id)
GROUP BY
    f.title;
"""
run_sql(cursor, sql)

                 title                                             actors
0     Academy Dinosaur  Christian Gable,Johnny Cage,Lucille Tracy,Mary...
1       Ace Goldfinger  Bob Fawcett,Chris Depp,Minnie Zellweger,Sean G...
2     Adaptation Holes  Bob Fawcett,Cameron Streep,Julianne Dench,Nick...
3     Affair Prejudice  Fay Winslet,Jodie Degeneres,Kenneth Pesci,Opra...
4          African Egg  Dustin Tautou,Gary Phoenix,Matthew Carrey,Matt...
..                 ...                                                ...
992     Young Language  Christopher West,Ed Chase,James Pitt,Julia Mcq...
993         Youth Kick  Ian Tandy,Mary Keitel,Sandra Kilmer,Scarlett B...
994       Zhivago Core  Gary Penn,Kenneth Hoffman,Nick Stallone,Salma ...
995  Zoolander Fiction  Carmen Hunt,Jada Ryder,Mary Tandy,Penelope Cro...
996          Zorro Ark               Ian Tandy,Lisa Monroe,Nick Degeneres

[997 rows x 2 columns]